projects.org
#+TITLE: index
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+AUTHOR: josiah

* projects
  I've worked on a few things that i'm proud of. Here's the highlights.

** [[https://git.awful.club/projects/pynit][Pynit]]
   - Created: 2019
   - Status: Archived
   pynit is a personal archival script that relies on pinboard. it pulls in saved posts through the reddit api (by way of ~praw~) and adds them to the linked ~pinboard~ account. I've written briefly about what I learned during this project [[./posts/pynit.html][here]].

** [[https://me.jowj.net/][jowj.net]]
   - Created: 2016
   - Status: Maintained
   This site! This site is a +cursed collection of elisp+ cool experiment in running a blog using orgmode and elisp. I've written about this project [[./posts/blogging-on-ghpages-with-orgmode.html][here]].

