projects.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>index</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="josiah" />
<link rel="stylesheet" type="text/css" href="posts/css/my-dark.css"/>

        <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/tooltipster.bundle.min.css"/>
        
        <link rel="stylesheet" type="text/css" href="https://alhassy.github.io/org-special-block-extras/tooltipster/dist/css/plugins/tooltipster/sideTip/themes/tooltipster-sideTip-punk.min.css" />
        
        
        
        
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="./index.html">home</a>
<a href="./posts/articles.html">essays</a>
<a href="./personal/articles.html">diary</a>
<a href="./projects.html">projects</a>
<a href="./resume.pdf">resume</a>
<a href="./lore.html">lore</a>
</nav>
</div>
<div id="content">
<h1 class="title">index</h1>

<div id="outline-container-org1810b83" class="outline-2">
<h2 id="org1810b83">projects</h2>
<div class="outline-text-2" id="text-org1810b83">
<p>
I've worked on a few things that i'm proud of. Here's the highlights.
</p>
</div>

<div id="outline-container-org628a179" class="outline-3">
<h3 id="org628a179"><a href="https://github.com/jowj/pynit">Pynit</a></h3>
<div class="outline-text-3" id="text-org628a179">
<ul class="org-ul">
<li>Created: 2019</li>
<li>Status: Archived</li>
</ul>
<p>
pynit is a personal archival script that relies on pinboard. it pulls in saved posts through the reddit api (by way of <code>praw</code>) and adds them to the linked <code>pinboard</code> account. I've written briefly about what I learned during this project <a href="./posts/pynit.html">here</a>.
</p>
</div>
</div>

<div id="outline-container-orgb6ec4c3" class="outline-3">
<h3 id="orgb6ec4c3"><a href="https://me.jowj.net/">jowj.net</a></h3>
<div class="outline-text-3" id="text-orgb6ec4c3">
<ul class="org-ul">
<li>Created: 2016</li>
<li>Status: Maintained</li>
</ul>
<p>
This site! This site is a <del>cursed collection of elisp</del> cool experiment in running a blog using orgmode and elisp. I've written about this project <a href="./posts/blogging-on-ghpages-with-orgmode.html">here</a>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator">Made with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.2 (<a href="https://orgmode.org">Org</a> mode 9.4.4)</p></p>
</div>
</body>
</html>
